trade_exp/src/Catalogs/МаркетинговыеМероприятия/МаркетинговыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>МаркетинговыеМероприятия</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="c73091d4-df84-416b-b922-292bad652bcb">
    <name>ВидАкции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2ae9479-c571-4679-84b4-7b266d558aa3">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc28c861-b1f1-4634-9c0b-44ce86962cc5">
    <name>СегментПартнеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08fbba43-8d05-4b08-9fdc-4b1752590134">
    <name>Завершено</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="15a17d46-90e2-4b4f-aff8-97f6003b84e9">
    <name>ПлановаяДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="85ac9f24-3837-4782-a585-56a0d879b1e6">
    <name>ПлановаяДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="39107d04-fe7d-4b1d-89e3-dd5ab7328e09">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f7e3491f-fa5c-4f9b-845d-3fc9d2e74e76">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37ce1685-dc81-4c83-8c8d-41c951b3174f">
    <name>СегментНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b1646f0d-1858-4e3b-aeba-44c3c6abc7a4">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c67c05fb-234f-4b67-bb6c-3d22c4fd239b">
    <name>Алгоритм</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d833614f-4c8d-4905-aff5-99423da2d475">
    <name>Промокод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="75a918bd-beee-43f3-a18d-0d1f5a06d59b">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dfc3f2b2-ba4e-4175-baa3-51b75736bf1b">
    <name>ТипОтбора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ee72e673-d0fa-4062-b4db-48866b97ec94">
    <name>БюджетАкции</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="47182116-8c5d-43df-9acd-c16a17e02949">
    <name>ТипОтбораПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="b1aa65f9-8969-4429-82be-1d3696361de3">
    <name>ПартнерыИКонтактныеЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0df12fc9-5869-4c64-892b-69872209a792">
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="04054850-afc8-46e1-8838-58b9a799d9f3">
      <name>РольПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="357743e8-165c-4eeb-918c-ee282061e1d4">
      <name>КонтактноеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0d602f20-0a08-45e4-9ea8-d3509b5ffcad">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="4662048c-988b-40e1-9c1b-d22e9a883984">
    <name>ТоварыАкции</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9b9b5f85-9670-470a-9686-c6df882241af">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c59564d8-df31-4aa6-b19d-2fff746be329">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1239bbd5-f2e0-4cd4-a620-0d3528a66025">
      <name>Процент</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
            <scale>1</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9e1db591-e524-4dd2-8d94-7f801ba78ebb">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="77141400-a5cb-47a5-a8cc-d87a803174d7">
      <name>ВидНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="00659616-12e6-49ba-ac39-a7e437c8d9a9">
      <name>ГруппаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="7e74afc2-2a2b-4a56-a6a4-35b421968295">
    <name>Действия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="aafec904-8da8-4417-8eda-c15e474197a7">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="d62d74a0-fa15-4567-ad4a-bd1b6e299029">
    <name>ПартнерыАкции</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9ed678a6-0e10-4705-89e4-699d8b6c84fd">
      <name>СегментПартнеров</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="09e18e44-8c22-4194-9df6-0805c09c69cb">
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d55e3f2b-4f2f-4a72-9410-92dbffff7e08">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="61ab45fc-991f-464a-815e-f62615097e77">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="2a4dea56-afad-464b-9da1-6c1850af97a4">
    <name>Подразделения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="91264b70-5b30-44c8-8b78-9db5998692ce">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/ЦеновыеГруппыБезБонусов/ЦеновыеГруппыБезБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6086962b-74f5-4a58-ae6a-5d03ab6b987a">
  <name>ЦеновыеГруппыБезБонусов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="047bb1a5-c6b2-46eb-a0d1-ab19e6518501">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f64f784a-7d5b-472e-8496-3c3b5d0e45f1">
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ТипОтбора/ТипОтбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0f33bed1-a59c-4bbd-aa97-b0e0b4cb5aef">
  <name>ТипОтбора</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b767e370-4bf6-4bd1-8775-1a5489e860cd">
    <name>ПоСписку</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7ad25d3f-0b4a-44db-8fb1-24a4bae7c7c3">
    <name>ПоСегменту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="764f86b6-2f54-40c0-8cc4-24a1b9567c35">
    <name>ПоВсемЭлементам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыДействияМаркетинговыхМероприятий/ТипыДействияМаркетинговыхМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2d1a99da-ba46-4dee-b77e-6acdaf25f112">
  <name>ТипыДействияМаркетинговыхМероприятий</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5eafd854-5f16-4357-b069-5d7c4f969104">
    <name>СменитьСтатусУчастникаБонуснойПрограммы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d3289f14-5ea3-47b6-a253-33b0f697d00f">
    <name>НачислитьБонусыСуммой</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="be142fa8-0902-4895-8dbc-f1ab2a79bed7">
    <name>УстановитьВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="375c2168-afdc-4f60-9d65-471130e7ffb4">
    <name>НачислитьБонусыПроцентом</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/МаркетинговыеМероприятия/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Перем ВыполняетсяЗакрытие;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьПоВидуАкции();
	УстановитьВидимостьПоАлгоритму();
	УстановитьВидимостьПоНоменклатуреОбщаяСтраница();
	УстановитьВидимостьПоНоменклатуре();
	УстановитьВидимостьПоПартнеру();
	УстановитьДоступность();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормыГруппыОсновное

&НаКлиенте
Процедура Док__ВидАкцииПриИзмененииПосле(Элемент)
	
	УстановитьВидимостьПоВидуАкции();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормыГруппыУсловияАкции

&НаКлиенте
Процедура Док_КлиентПриИзмененииПосле(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		Объект.СегментПартнеров="";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Док_СегментПартнеровПриИзмененииПосле(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СегментПартнеров) Тогда
		 Объект.Клиент="";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Док_АлгоритмПриИзмененииПосле(Элемент)
	
	УстановитьВидимостьПоАлгоритму();
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТипОтбораПриИзмененииПосле(Элемент)
	
	УстановитьВидимостьПоНоменклатуре();
	ПоказатьИнформациюБезБонусовПриЗакрытии()
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТипОтбора1ПриИзмененииПосле(Элемент)
	УстановитьВидимостьПоНоменклатуреОбщаяСтраница();
КонецПроцедуры

&НаКлиенте
Процедура Док_ТипОтбора2ПриИзмененииПосле(Элемент)
	УстановитьВидимостьПоПартнеру();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Док__ЗагрузитьИзExcelПосле(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузкаЗавершение",ЭтотОбъект,"ТоварыАкции"); 
	ПараметрыФормы = Новый Структура("ИмяТаблицы,Колонки","Товары","Код,Наименование,Подразделение");
	ОткрытьФорму("Справочник.МаркетинговыеМероприятия.Форма.Док_Форма_ЗагрузкаExel",ПараметрыФормы,ЭтаФорма,,,,Оповещение,);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДействия

&НаКлиенте
Процедура Док_ДействияПриАктивизацииСтрокиПосле(Элемент)
	
	ТекущаяСтрока = Элементы.Действия.ТекущиеДанные;
	
	Если Не ТекущаяСтрока = Неопределено Тогда
		Элементы._НадписьДействия.Заголовок = СформироватьСтрокуПоРеквизитамЭлементаСправочника(ТекущаяСтрока.Действие);
	Иначе
		Элементы._НадписьДействия.Заголовок = "";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УстановитьВидимостьПоНоменклатуре()
		
	Элементы.ТоварыАкции.Видимость = (Объект.ТипОтбора = Перечисления.ТипОтбора.ПоСписку);
    Элементы.СегментНоменклатуры.Видимость = (Объект.ТипОтбора = Перечисления.ТипОтбора.ПоСегменту);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоПартнеру()
		
	Элементы.ПартнерыАкции.Видимость = (Объект.ТипОтбораПартнер = Перечисления.ТипОтбора.ПоСписку);
    Элементы.СегментПартнеров.Видимость = (Объект.ТипОтбораПартнер = Перечисления.ТипОтбора.ПоСегменту);

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	Элементы.Завершено.Доступность = РольДоступна("ПолныеПрава");
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоНоменклатуреОбщаяСтраница()
		
	Элементы.ТоварыАкции1.Видимость = (Объект.ТипОтбора = Перечисления.ТипОтбора.ПоСписку);
    Элементы.СегментНоменклатуры1.Видимость = (Объект.ТипОтбора = Перечисления.ТипОтбора.ПоСегменту);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоАлгоритму()
	
	Элементы.Промокод.Видимость = (Объект.Алгоритм = Перечисления.АлгоритмыАкций.ЗаПромокод);
    Элементы._ГруппаОтборКлиентов.Видимость = Не (Объект.Алгоритм = Перечисления.АлгоритмыАкций.ЗаПромокод);
	Элементы._ГруппаОтборТоваров.Видимость = Не (Объект.Алгоритм = Перечисления.АлгоритмыАкций.ЗаПромокод);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоВидуАкции()
	
	Элементы._ГруппаУсловияАкции.Видимость = (Объект.ВидАкции = Перечисления.ВидыАкций.Алгоритм);
    Элементы._ТоварыАкции.Видимость = НЕ (Объект.ВидАкции = Перечисления.ВидыАкций.Алгоритм);

КонецПроцедуры


&НаСервере
Функция СформироватьСтрокуПоРеквизитамЭлементаСправочника(Действие)
	
	Возврат ?(Не Действие.Пустая(),"Тип - "+Строка(Действие.Тип)+ ?(ЗначениеЗаполнено(Действие.ПроцентБонусов), ", Процент бонусов - " + Строка(Действие.ПроцентБонусов),"") 
	+ ?(ЗначениеЗаполнено(Действие.СтатусУчастникаБонуснойПрограммы), ", Статус участника бонусной программы - " + Строка(Действие.СтатусУчастникаБонуснойПрограммы),"") + ?(ЗначениеЗаполнено(Действие.ВидЦены), ", Вид цены - " + Строка(Действие.ВидЦены),"")
	+ ?(ЗначениеЗаполнено(Действие.СуммаБонусов), ", Сумма бонусов - " + Строка(Действие.СуммаБонусов),"") + ?(ЗначениеЗаполнено(Действие.Причина), ", Причина - " + Строка(Действие.Причина), ""),"");
	
КонецФункции

&НаКлиенте 
Процедура ЗагрузкаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ЗагрузкаЗавершениеСервер(Результат, ДополнительныеПараметры);
КонецПроцедуры 

&НаСервере 
Процедура ЗагрузкаЗавершениеСервер(Результат, ДополнительныеПараметры)
	Если Результат <> Неопределено тогда
		 Объект[ДополнительныеПараметры].Загрузить(Результат.Выгрузить());	
	конецесли;
КонецПроцедуры 

&НаКлиенте
Процедура Док_ДействияПередНачаломДобавленияПосле(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.Действия.Количество()=1 Тогда
		Сообщить("Больше одного действия добавить нельзя!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док__ЗагрузитьИзExcelТоварыАкцииПосле(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузкаЗавершение",ЭтотОбъект,"ТоварыАкции"); 
	ПараметрыФормы = Новый Структура("ИмяТаблицы,Колонки","ТоварыАкции","ВидНоменклатуры,ГруппаНоменклатуры,Номенклатура,Процент,ВидЦены");
	ОткрытьФорму("Справочник.МаркетинговыеМероприятия.Форма.Док_Форма_ЗагрузкаExel",ПараметрыФормы,ЭтаФорма,,,,Оповещение,);

КонецПроцедуры

&НаКлиенте
Процедура Док__ЗагрузитьИзExcelПартнерыАкцииПосле(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузкаЗавершение",ЭтотОбъект,"ПартнерыАкции"); 
	ПараметрыФормы = Новый Структура("ИмяТаблицы,Колонки","ПартнерыАкции","СегментПартнеров,Партнер,Свойство,Значение");
	ОткрытьФорму("Справочник.МаркетинговыеМероприятия.Форма.Док_Форма_ЗагрузкаExel",ПараметрыФормы,ЭтаФорма,,,,Оповещение,);

КонецПроцедуры

&НаКлиенте
Процедура Док_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	

	Если Объект.ВидАкции = ПредопределенноеЗначение("Перечисление.ВидыАкций.Алгоритм") Тогда
		
		СообщениеОшибки = "";
		
		Если Объект.Действия.Количество()=0 Тогда
			СообщениеОшибки = СообщениеОшибки + "Укажите действия в табличной части." + Символы.ПС;
		КонецЕсли;
		
		Если Объект.Алгоритм = ПредопределенноеЗначение("Перечисление.АлгоритмыАкций.ЗаПромокод") Тогда
			Если Не ПустаяСтрока(СообщениеОшибки) Тогда
				Сообщить(СообщениеОшибки);
				Отказ = Истина;
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ТипОтбора) Тогда
			СообщениеОшибки = СообщениеОшибки + "Укажите тип отбора номенклатуры." + Символы.ПС;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ТипОтбораПартнер) Тогда
			СообщениеОшибки = СообщениеОшибки + "Укажите тип отбора партнера." + Символы.ПС;
		КонецЕсли;  
		
		Если ПроверкаЗаполненияТаблицыТоварыАкции() Тогда 
			СообщениеОшибки = СообщениеОшибки + "Присутствуют пустые строки в таблице товары Акции" + Символы.ПС;
		КонецЕсли;
		
		Если Не ПустаяСтрока(СообщениеОшибки) Тогда
			Сообщить(СообщениеОшибки);
			Отказ = Истина;
		КонецЕсли

	КонецЕсли; 
						
КонецПроцедуры  

&НаСервере
Функция ПроверкаЗаполненияТаблицыТоварыАкции()
	
	Для каждого Строка из Объект.ТоварыАкции Цикл 
			Если Строка.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПустаяСсылка() 
				И Строка.ГруппаНоменклатуры = Справочники.Номенклатура.ПустаяСсылка() 
				И Строка.Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда 
				
					Возврат Истина; 
				КонецЕсли; 
			КонецЦикла;
			Возврат Ложь; 
КонецФункции

#Область ИнформацияПоЦеновымГРуппамБезБонусов

&НаКлиенте
Процедура Док_ПередЗакрытиемПеред(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ВыполняетсяЗакрытие Тогда
		СообщениеБезБонусов = ПроверитьЦеновыеГруппыБезБонусов(); 
	
		Если СообщениеБезБонусов <> "" Тогда   
			
			СообщениеБезБонусов = 
				"В этом маркетинговом мероприятии присутствует товар, 
				|относящийся к ценовым группам без начисления бонусов:"
				+ СообщениеБезБонусов;

	    	Отказ = Истина;
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), СообщениеБезБонусов, 0, "Бонусы начислены не будут");
	
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Параметры) Экспорт
	ВыполняетсяЗакрытие = Истина;
    Закрыть();
КонецПроцедуры

&НаСервере
Функция ПроверитьЦеновыеГруппыБезБонусов() 
	
	ТекстСообщения = "";
	
	Если Не Объект.ПометкаУдаления И Не Объект.Завершено И Объект.ДатаОкончания >= НачалоДня(ТекущаяДата()) 
		И Объект.Алгоритм = ПредопределенноеЗначение("Перечисление.АлгоритмыАкций.ЗаТовар")
		И Объект.Действия.Количество() > 0  
		И (Объект.Действия[0].Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыПроцентом 
			Или Объект.Действия[0].Действие.Тип = Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыСуммой) Тогда
		
		Запрос = Новый Запрос;  
		Запрос.Текст = "	
			|ВЫБРАТЬ 
			|	ЦеноваяГруппа,
			|	ДатаОкончанияДействия
			|ПОМЕСТИТЬ втЦеновыеГруппыБезБонусовПоследние
			|ИЗ
			|	РегистрСведений.ЦеновыеГруппыБезБонусов.СрезПоследних(&Дата)
			|;
			|////////////////////////////////////////////////////////////////////////////////     
			|ВЫБРАТЬ 
			|	ЦеноваяГруппа
			|ПОМЕСТИТЬ втЦеновыеГруппыБезБонусов
			|ИЗ
			|	втЦеновыеГруппыБезБонусовПоследние
			|ГДЕ 
			|	ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)  
			|ОБЪЕДИНИТЬ
			|ВЫБРАТЬ 
			|	ЦеноваяГруппа    
			|ИЗ
			|	втЦеновыеГруппыБезБонусовПоследние
			|ГДЕ 
			|	ДатаОкончанияДействия >= &Дата
			|;";
		
		Если Объект.ТипОтбора = ПредопределенноеЗначение("Перечисление.ТипОтбора.ПоВсемЭлементам") Тогда   
			
			Запрос.Текст = Запрос.Текст + "	
				|ВЫБРАТЬ 
				|    втЦеновыеГруппыБезБонусов.ЦеноваяГруппа,
				|    ЦеновыеГруппы.Наименование КАК ЦеноваяГруппаНаименование		
				|ИЗ 
				|	втЦеновыеГруппыБезБонусов 
				|	СОЕДИНЕНИЕ 
				|		Справочник.ЦеновыеГруппы КАК ЦеновыеГруппы
				|		ПО втЦеновыеГруппыБезБонусов.ЦеноваяГруппа = ЦеновыеГруппы.Ссылка";	
			
		Иначе	// Отборы по сегменту и списку
			
			Запрос.Текст = Запрос.Текст + "	
				|ВЫБРАТЬ
				|	 СпрНоменклатура.Ссылка КАК Номенклатура,
				|    втЦеновыеГруппыБезБонусов.ЦеноваяГруппа,
				|    втЦеновыеГруппыБезБонусов.ЦеноваяГруппа.Наименование КАК ЦеноваяГруппаНаименование		
				|ПОМЕСТИТЬ 
				|	втНоменклатураБезБонусов
				|ИЗ 
				|	Справочник.Номенклатура КАК СпрНоменклатура
				|	СОЕДИНЕНИЕ 
				|		втЦеновыеГруппыБезБонусов  
				|	ПО  СпрНоменклатура.ЦеноваяГруппа = втЦеновыеГруппыБезБонусов.ЦеноваяГруппа			
				|;";
			
			
			// Отборы по сегменту
			Если Объект.ТипОтбора = ПредопределенноеЗначение("Перечисление.ТипОтбора.ПоСегменту") Тогда   
				
				Запрос.Текст = Запрос.Текст + "					
					|ВЫБРАТЬ РАЗЛИЧНЫЕ 
					|	Номенклатура   
					|ПОМЕСТИТЬ 
					|	втНоменклатураМероприятия
					|ИЗ 
					|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
					|ГДЕ 
					|	Сегмент = &Сегмент  
					|;";  
				
				Запрос.УстановитьПараметр("Сегмент", Объект.СегментНоменклатуры);
				
			Иначе // Отборы по списку    
				
				Запрос.Текст = Запрос.Текст + "					
					|ВЫБРАТЬ 
					| Номенклатура   
					|ПОМЕСТИТЬ 
					|	втНоменклатураМероприятия
					|ИЗ 
					|	&ТаблицаНоменклатурыМероприятия КАК ТаблицаНоменклатурыМероприятия
					|;";  
				
				ТЗНоменклатурыМероприятия = Новый ТаблицаЗначений;    
				ТЗНоменклатурыМероприятия.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
				
				Для Каждого СтрокаТовары Из Объект.ТоварыАкции Цикл
					
					Если ЗначениеЗаполнено(СтрокаТовары.ВидНоменклатуры) Или ЗначениеЗаполнено(СтрокаТовары.ГруппаНоменклатуры) Тогда
					
						Если ЗначениеЗаполнено(СтрокаТовары.ВидНоменклатуры) Тогда	
							ТЗ = ПолучитьНоменклатуруПоВиду(СтрокаТовары.ВидНоменклатуры); 
						Иначе	
							ТЗ = ПолучитьНоменклатуруПоГруппе(СтрокаТовары.ГруппаНоменклатуры); 	
						КонецЕсли;	
						
						Если ТЗ.Количество() > 0 Тогда
							Для Счетчик = 1 По ТЗ.Количество() Цикл
								ТЗНоменклатурыМероприятия.Вставить(0);	
							КонецЦикла;        
							ТЗНоменклатурыМероприятия.ЗагрузитьКолонку(ТЗ.ВыгрузитьКолонку(0), 0);
						КонецЕсли;
						
					Иначе // Номенклатура
						СтрокаНоменклатурыМероприятия = ТЗНоменклатурыМероприятия.Добавить();
						СтрокаНоменклатурыМероприятия.Номенклатура = СтрокаТовары.Номенклатура;
					КонецЕсли;  
					
				КонецЦикла; 
				
				Запрос.УстановитьПараметр("ТаблицаНоменклатурыМероприятия", ТЗНоменклатурыМероприятия);
				
			КонецЕсли;   
				
			Запрос.Текст = Запрос.Текст + "	
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|    втНоменклатураБезБонусов.ЦеноваяГруппа,
				|    втНоменклатураБезБонусов.ЦеноваяГруппаНаименование		
				|ИЗ 
				|	втНоменклатураМероприятия
				|	СОЕДИНЕНИЕ 
				|		втНоменклатураБезБонусов
				|	ПО втНоменклатураМероприятия.Номенклатура = втНоменклатураБезБонусов.Номенклатура
				|УПОРЯДОЧИТЬ ПО 
				|	втНоменклатураБезБонусов.ЦеноваяГруппаНаименование		
				|;";
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл        
			ТекстСообщения = ТекстСообщения + Символы.ПС + Выборка.ЦеноваяГруппаНаименование;
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстСообщения;
КонецФункции	

&НаСервере
Функция ПолучитьНоменклатуруПоВиду(ВидНоменклатуры)
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура 
		|ГДЕ
		|	ВидНоменклатуры = &ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
		
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ПолучитьНоменклатуруПоГруппе(ГруппаНоменклатуры)
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура 
		|ГДЕ
		|	Родитель В ИЕРАРХИИ(&ГруппаНоменклатуры)";
	
	Запрос.УстановитьПараметр("ГруппаНоменклатуры", ГруппаНоменклатуры);
		
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции 

&НаКлиенте
Процедура Док_ТоварыАкцииПриИзмененииПосле(Элемент)
	ПоказатьИнформациюБезБонусовПриЗакрытии()	
КонецПроцедуры

&НаКлиенте
Процедура Док_СегментНоменклатурыПриИзмененииПосле(Элемент)
	ПоказатьИнформациюБезБонусовПриЗакрытии()
КонецПроцедуры    

&НаКлиенте
Процедура ПоказатьИнформациюБезБонусовПриЗакрытии()
    ВыполняетсяЗакрытие = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Док_ДатаНачалаПриИзмененииПосле(Элемент)
	Объект.ПлановаяДатаНачала = Объект.ДатаНачала;
КонецПроцедуры

&НаКлиенте
Процедура Док_ДатаОкончанияПриИзмененииПосле(Элемент)
	Объект.ПлановаяДатаОкончания = Объект.ДатаОкончания;
КонецПроцедуры


#КонецОбласти

#КонецОбласти

ВыполняетсяЗакрытие = Ложь;
